cases/diamond_Re150/fine/system/sampleMeanDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleMeanDict;
}

type                sets;
libs                (sampling);
writeControl        writeTime;

interpolationScheme cellPoint;
setFormat           csv;

sets
(
    wake_x1D
    {
        type    lineCell;
        axis    y;
        start   (1.0 -3.0 0.0);
        end     (1.0  3.0 0.0);
    }

    wake_x2D
    {
        type    lineCell;
        axis    y;
        start   (2.0 -3.0 0.0);
        end     (2.0  3.0 0.0);
    }

    wake_x5D
    {
        type    lineCell;
        axis    y;
        start   (5.0 -3.0 0.0);
        end     (5.0  3.0 0.0);
    }

    wake_x10D
    {
        type    lineCell;
        axis    y;
        start   (10.0 -3.0 0.0);
        end     (10.0  3.0 0.0);
    }

    wake_x15D
    {
        type    lineCell;
        axis    y;
        start   (15.0 -3.0 0.0);
        end     (15.0  3.0 0.0);
    }

    centerline
    {
        type    lineCell;
        axis    x;
        start   (0.5  0.0 0.0);
        end     (20.0 0.0 0.0);
    }
);

fields  (UMean pMean);
